program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3401.3.1"}, {"coremlc-version", "3401.4.1"}})]
{
    func main<ios17>(tensor<fp16, [480000]> waveform) {
            tensor<int32, []> var_3 = const()[name = tensor<string, []>("op_3"), val = tensor<int32, []>(0)];
            tensor<int32, []> sliding_windows_0_size_0 = const()[name = tensor<string, []>("sliding_windows_0_size_0"), val = tensor<int32, []>(160000)];
            tensor<int32, []> sliding_windows_0_stride_0 = const()[name = tensor<string, []>("sliding_windows_0_stride_0"), val = tensor<int32, []>(16000)];
            tensor<fp16, [21, 160000]> sliding_windows_0_cast_fp16 = sliding_windows(axis = var_3, size = sliding_windows_0_size_0, stride = sliding_windows_0_stride_0, x = waveform)[name = tensor<string, []>("sliding_windows_0_cast_fp16")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [21, 1, 160000]> sliding_window_waveform = expand_dims(axes = input_1_axes_0, x = sliding_windows_0_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_9 = const()[name = tensor<string, []>("op_9"), val = tensor<int32, []>(-1)];
            tensor<fp32, []> var_26 = const()[name = tensor<string, []>("op_26"), val = tensor<fp32, []>(0x1.47ae14p-7)];
            tensor<fp16, [1]> model_sincnet_wav_norm1d_weight_to_fp16 = const()[name = tensor<string, []>("model_sincnet_wav_norm1d_weight_to_fp16"), val = tensor<fp16, [1]>([0x1.44p-7])];
            tensor<fp16, [1]> model_sincnet_wav_norm1d_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_wav_norm1d_bias_to_fp16"), val = tensor<fp16, [1]>([0x1.734p-5])];
            tensor<fp16, []> var_17_to_fp16 = const()[name = tensor<string, []>("op_17_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [21, 1, 160000]> input_3_cast_fp16 = instance_norm(beta = model_sincnet_wav_norm1d_bias_to_fp16, epsilon = var_17_to_fp16, gamma = model_sincnet_wav_norm1d_weight_to_fp16, x = sliding_window_waveform)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> outputs_pad_type_0 = const()[name = tensor<string, []>("outputs_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> outputs_strides_0 = const()[name = tensor<string, []>("outputs_strides_0"), val = tensor<int32, [1]>([10])];
            tensor<int32, [2]> outputs_pad_0 = const()[name = tensor<string, []>("outputs_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> outputs_dilations_0 = const()[name = tensor<string, []>("outputs_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> outputs_groups_0 = const()[name = tensor<string, []>("outputs_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [80, 1, 251]> model_sincnet_conv1d_0_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [20080]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20224))), name = tensor<string, []>("model_sincnet_conv1d_0_weight_to_fp16_palettized"), shape = tensor<uint32, [3]>([80, 1, 251])];
            tensor<fp16, [21, 80, 15975]> outputs_cast_fp16 = conv(dilations = outputs_dilations_0, groups = outputs_groups_0, pad = outputs_pad_0, pad_type = outputs_pad_type_0, strides = outputs_strides_0, weight = model_sincnet_conv1d_0_weight_to_fp16_palettized, x = input_3_cast_fp16)[name = tensor<string, []>("outputs_cast_fp16")];
            tensor<fp16, [21, 80, 15975]> input_5_cast_fp16 = abs(x = outputs_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> var_57 = const()[name = tensor<string, []>("op_57"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_58 = const()[name = tensor<string, []>("op_58"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_7_ceil_mode_0 = const()[name = tensor<string, []>("input_7_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [21, 80, 5325]> input_7_cast_fp16 = max_pool(ceil_mode = input_7_ceil_mode_0, kernel_sizes = var_57, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_58, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<fp16, [80]> model_sincnet_norm1d_0_weight_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_0_weight_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20800)))];
            tensor<fp16, [80]> model_sincnet_norm1d_0_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_0_bias_to_fp16"), val = tensor<fp16, [80]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21056)))];
            tensor<fp16, [21, 80, 5325]> input_9_cast_fp16 = instance_norm(beta = model_sincnet_norm1d_0_bias_to_fp16, epsilon = var_17_to_fp16, gamma = model_sincnet_norm1d_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, [21, 80, 5325]> input_11_cast_fp16 = leaky_relu(alpha = var_26, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> input_13_strides_0 = const()[name = tensor<string, []>("input_13_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> input_13_dilations_0 = const()[name = tensor<string, []>("input_13_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_13_groups_0 = const()[name = tensor<string, []>("input_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [60, 80, 5]> model_sincnet_conv1d_1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [24000]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21312))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45376))), name = tensor<string, []>("model_sincnet_conv1d_1_weight_to_fp16_palettized"), shape = tensor<uint32, [3]>([60, 80, 5])];
            tensor<fp16, [60]> model_sincnet_conv1d_1_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_conv1d_1_bias_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45952)))];
            tensor<fp16, [21, 60, 5321]> input_13_cast_fp16 = conv(bias = model_sincnet_conv1d_1_bias_to_fp16, dilations = input_13_dilations_0, groups = input_13_groups_0, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = input_13_strides_0, weight = model_sincnet_conv1d_1_weight_to_fp16_palettized, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [1]> var_73 = const()[name = tensor<string, []>("op_73"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_74 = const()[name = tensor<string, []>("op_74"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_15_pad_type_0 = const()[name = tensor<string, []>("input_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_15_pad_0 = const()[name = tensor<string, []>("input_15_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_15_ceil_mode_0 = const()[name = tensor<string, []>("input_15_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [21, 60, 1773]> input_15_cast_fp16 = max_pool(ceil_mode = input_15_ceil_mode_0, kernel_sizes = var_73, pad = input_15_pad_0, pad_type = input_15_pad_type_0, strides = var_74, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [60]> model_sincnet_norm1d_1_weight_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_1_weight_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46144)))];
            tensor<fp16, [60]> model_sincnet_norm1d_1_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_1_bias_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46336)))];
            tensor<fp16, [21, 60, 1773]> input_17_cast_fp16 = instance_norm(beta = model_sincnet_norm1d_1_bias_to_fp16, epsilon = var_17_to_fp16, gamma = model_sincnet_norm1d_1_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [21, 60, 1773]> input_19_cast_fp16 = leaky_relu(alpha = var_26, x = input_17_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [1]> input_21_strides_0 = const()[name = tensor<string, []>("input_21_strides_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, [2]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [1]> input_21_dilations_0 = const()[name = tensor<string, []>("input_21_dilations_0"), val = tensor<int32, [1]>([1])];
            tensor<int32, []> input_21_groups_0 = const()[name = tensor<string, []>("input_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [60, 60, 5]> model_sincnet_conv1d_2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [18000]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46528))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64640))), name = tensor<string, []>("model_sincnet_conv1d_2_weight_to_fp16_palettized"), shape = tensor<uint32, [3]>([60, 60, 5])];
            tensor<fp16, [60]> model_sincnet_conv1d_2_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_conv1d_2_bias_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65216)))];
            tensor<fp16, [21, 60, 1769]> input_21_cast_fp16 = conv(bias = model_sincnet_conv1d_2_bias_to_fp16, dilations = input_21_dilations_0, groups = input_21_groups_0, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = input_21_strides_0, weight = model_sincnet_conv1d_2_weight_to_fp16_palettized, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [1]> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, [1]>([3])];
            tensor<int32, [1]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [1]>([3])];
            tensor<string, []> input_23_pad_type_0 = const()[name = tensor<string, []>("input_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> input_23_pad_0 = const()[name = tensor<string, []>("input_23_pad_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<bool, []> input_23_ceil_mode_0 = const()[name = tensor<string, []>("input_23_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [21, 60, 589]> input_23_cast_fp16 = max_pool(ceil_mode = input_23_ceil_mode_0, kernel_sizes = var_89, pad = input_23_pad_0, pad_type = input_23_pad_type_0, strides = var_90, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [60]> model_sincnet_norm1d_2_weight_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_2_weight_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65408)))];
            tensor<fp16, [60]> model_sincnet_norm1d_2_bias_to_fp16 = const()[name = tensor<string, []>("model_sincnet_norm1d_2_bias_to_fp16"), val = tensor<fp16, [60]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65600)))];
            tensor<fp16, [21, 60, 589]> input_25_cast_fp16 = instance_norm(beta = model_sincnet_norm1d_2_bias_to_fp16, epsilon = var_17_to_fp16, gamma = model_sincnet_norm1d_2_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [21, 60, 589]> x_cast_fp16 = leaky_relu(alpha = var_26, x = input_25_cast_fp16)[name = tensor<string, []>("x_cast_fp16")];
            tensor<int32, [3]> transpose_2_perm_0 = const()[name = tensor<string, []>("transpose_2_perm_0"), val = tensor<int32, [3]>([2, 0, 1])];
            tensor<string, []> input_29_lstm_layer_0_direction_0 = const()[name = tensor<string, []>("input_29_lstm_layer_0_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_29_lstm_layer_0_output_sequence_0 = const()[name = tensor<string, []>("input_29_lstm_layer_0_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_29_lstm_layer_0_recurrent_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_0_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_29_lstm_layer_0_cell_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_0_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_29_lstm_layer_0_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_0_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp16, [21, 256]> input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [5376]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(65792))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71232))), name = tensor<string, []>("input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized"), shape = tensor<uint32, [2]>([21, 256])];
            tensor<fp16, [512, 60]> concat_4_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [30720]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71808))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102592))), name = tensor<string, []>("concat_4_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 60])];
            tensor<fp16, [512, 128]> concat_5_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103168))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(168768))), name = tensor<string, []>("concat_5_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_0_to_fp16 = const()[name = tensor<string, []>("add_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(169344)))];
            tensor<fp16, [512, 60]> concat_6_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [30720]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170432))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201216))), name = tensor<string, []>("concat_6_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 60])];
            tensor<fp16, [512, 128]> concat_7_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(201792))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(267392))), name = tensor<string, []>("concat_7_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_1_to_fp16 = const()[name = tensor<string, []>("add_1_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(267968)))];
            tensor<fp16, [589, 21, 60]> transpose_2_cast_fp16 = transpose(perm = transpose_2_perm_0, x = x_cast_fp16)[name = tensor<string, []>("transpose_1")];
            tensor<fp16, [589, 21, 256]> input_29_lstm_layer_0_cast_fp16_0, tensor<fp16, [21, 256]> input_29_lstm_layer_0_cast_fp16_1, tensor<fp16, [21, 256]> input_29_lstm_layer_0_cast_fp16_2 = lstm(activation = input_29_lstm_layer_0_activation_0, bias = add_0_to_fp16, bias_back = add_1_to_fp16, cell_activation = input_29_lstm_layer_0_cell_activation_0, direction = input_29_lstm_layer_0_direction_0, initial_c = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, initial_h = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, output_sequence = input_29_lstm_layer_0_output_sequence_0, recurrent_activation = input_29_lstm_layer_0_recurrent_activation_0, weight_hh = concat_5_to_fp16_palettized, weight_hh_back = concat_7_to_fp16_palettized, weight_ih = concat_4_to_fp16_palettized, weight_ih_back = concat_6_to_fp16_palettized, x = transpose_2_cast_fp16)[name = tensor<string, []>("input_29_lstm_layer_0_cast_fp16")];
            tensor<string, []> input_29_lstm_layer_1_direction_0 = const()[name = tensor<string, []>("input_29_lstm_layer_1_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_29_lstm_layer_1_output_sequence_0 = const()[name = tensor<string, []>("input_29_lstm_layer_1_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_29_lstm_layer_1_recurrent_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_1_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_29_lstm_layer_1_cell_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_1_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_29_lstm_layer_1_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_1_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp16, [512, 256]> concat_14_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(269056))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(400192))), name = tensor<string, []>("concat_14_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_15_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(400768))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(466368))), name = tensor<string, []>("concat_15_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_2_to_fp16 = const()[name = tensor<string, []>("add_2_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(466944)))];
            tensor<fp16, [512, 256]> concat_16_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(468032))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(599168))), name = tensor<string, []>("concat_16_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_17_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(599744))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(665344))), name = tensor<string, []>("concat_17_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_3_to_fp16 = const()[name = tensor<string, []>("add_3_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(665920)))];
            tensor<fp16, [589, 21, 256]> input_29_lstm_layer_1_cast_fp16_0, tensor<fp16, [21, 256]> input_29_lstm_layer_1_cast_fp16_1, tensor<fp16, [21, 256]> input_29_lstm_layer_1_cast_fp16_2 = lstm(activation = input_29_lstm_layer_1_activation_0, bias = add_2_to_fp16, bias_back = add_3_to_fp16, cell_activation = input_29_lstm_layer_1_cell_activation_0, direction = input_29_lstm_layer_1_direction_0, initial_c = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, initial_h = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, output_sequence = input_29_lstm_layer_1_output_sequence_0, recurrent_activation = input_29_lstm_layer_1_recurrent_activation_0, weight_hh = concat_15_to_fp16_palettized, weight_hh_back = concat_17_to_fp16_palettized, weight_ih = concat_14_to_fp16_palettized, weight_ih_back = concat_16_to_fp16_palettized, x = input_29_lstm_layer_0_cast_fp16_0)[name = tensor<string, []>("input_29_lstm_layer_1_cast_fp16")];
            tensor<string, []> input_29_lstm_layer_2_direction_0 = const()[name = tensor<string, []>("input_29_lstm_layer_2_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_29_lstm_layer_2_output_sequence_0 = const()[name = tensor<string, []>("input_29_lstm_layer_2_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_29_lstm_layer_2_recurrent_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_2_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_29_lstm_layer_2_cell_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_2_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_29_lstm_layer_2_activation_0 = const()[name = tensor<string, []>("input_29_lstm_layer_2_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp16, [512, 256]> concat_24_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(667008))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(798144))), name = tensor<string, []>("concat_24_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_25_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(798720))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(864320))), name = tensor<string, []>("concat_25_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_4_to_fp16 = const()[name = tensor<string, []>("add_4_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(864896)))];
            tensor<fp16, [512, 256]> concat_26_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(865984))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(997120))), name = tensor<string, []>("concat_26_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_27_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(997696))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1063296))), name = tensor<string, []>("concat_27_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_5_to_fp16 = const()[name = tensor<string, []>("add_5_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1063872)))];
            tensor<fp16, [589, 21, 256]> input_29_lstm_layer_2_cast_fp16_0, tensor<fp16, [21, 256]> input_29_lstm_layer_2_cast_fp16_1, tensor<fp16, [21, 256]> input_29_lstm_layer_2_cast_fp16_2 = lstm(activation = input_29_lstm_layer_2_activation_0, bias = add_4_to_fp16, bias_back = add_5_to_fp16, cell_activation = input_29_lstm_layer_2_cell_activation_0, direction = input_29_lstm_layer_2_direction_0, initial_c = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, initial_h = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, output_sequence = input_29_lstm_layer_2_output_sequence_0, recurrent_activation = input_29_lstm_layer_2_recurrent_activation_0, weight_hh = concat_25_to_fp16_palettized, weight_hh_back = concat_27_to_fp16_palettized, weight_ih = concat_24_to_fp16_palettized, weight_ih_back = concat_26_to_fp16_palettized, x = input_29_lstm_layer_1_cast_fp16_0)[name = tensor<string, []>("input_29_lstm_layer_2_cast_fp16")];
            tensor<string, []> input_29_batch_first_direction_0 = const()[name = tensor<string, []>("input_29_batch_first_direction_0"), val = tensor<string, []>("bidirectional")];
            tensor<bool, []> input_29_batch_first_output_sequence_0 = const()[name = tensor<string, []>("input_29_batch_first_output_sequence_0"), val = tensor<bool, []>(true)];
            tensor<string, []> input_29_batch_first_recurrent_activation_0 = const()[name = tensor<string, []>("input_29_batch_first_recurrent_activation_0"), val = tensor<string, []>("sigmoid")];
            tensor<string, []> input_29_batch_first_cell_activation_0 = const()[name = tensor<string, []>("input_29_batch_first_cell_activation_0"), val = tensor<string, []>("tanh")];
            tensor<string, []> input_29_batch_first_activation_0 = const()[name = tensor<string, []>("input_29_batch_first_activation_0"), val = tensor<string, []>("tanh")];
            tensor<fp16, [512, 256]> concat_34_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1064960))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1196096))), name = tensor<string, []>("concat_34_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_35_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1196672))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1262272))), name = tensor<string, []>("concat_35_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_6_to_fp16 = const()[name = tensor<string, []>("add_6_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1262848)))];
            tensor<fp16, [512, 256]> concat_36_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [131072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1263936))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1395072))), name = tensor<string, []>("concat_36_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 256])];
            tensor<fp16, [512, 128]> concat_37_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [65536]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1395648))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1461248))), name = tensor<string, []>("concat_37_to_fp16_palettized"), shape = tensor<uint32, [2]>([512, 128])];
            tensor<fp16, [512]> add_7_to_fp16 = const()[name = tensor<string, []>("add_7_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1461824)))];
            tensor<fp16, [589, 21, 256]> input_29_batch_first_cast_fp16_0, tensor<fp16, [21, 256]> input_29_batch_first_cast_fp16_1, tensor<fp16, [21, 256]> input_29_batch_first_cast_fp16_2 = lstm(activation = input_29_batch_first_activation_0, bias = add_6_to_fp16, bias_back = add_7_to_fp16, cell_activation = input_29_batch_first_cell_activation_0, direction = input_29_batch_first_direction_0, initial_c = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, initial_h = input_29_lstm_layer_0_lstm_h0_reshaped_to_fp16_palettized, output_sequence = input_29_batch_first_output_sequence_0, recurrent_activation = input_29_batch_first_recurrent_activation_0, weight_hh = concat_35_to_fp16_palettized, weight_hh_back = concat_37_to_fp16_palettized, weight_ih = concat_34_to_fp16_palettized, weight_ih_back = concat_36_to_fp16_palettized, x = input_29_lstm_layer_2_cast_fp16_0)[name = tensor<string, []>("input_29_batch_first_cast_fp16")];
            tensor<int32, [3]> input_29_perm_0 = const()[name = tensor<string, []>("input_29_perm_0"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<fp16, [128, 256]> model_linear_0_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [32768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1462912))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1495744))), name = tensor<string, []>("model_linear_0_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([128, 256])];
            tensor<fp16, [128]> model_linear_0_bias_to_fp16 = const()[name = tensor<string, []>("model_linear_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1496320)))];
            tensor<fp16, [21, 589, 256]> input_29_cast_fp16 = transpose(perm = input_29_perm_0, x = input_29_batch_first_cast_fp16_0)[name = tensor<string, []>("transpose_0")];
            tensor<fp16, [21, 589, 128]> linear_0_cast_fp16 = linear(bias = model_linear_0_bias_to_fp16, weight = model_linear_0_weight_to_fp16_palettized, x = input_29_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [21, 589, 128]> input_33_cast_fp16 = leaky_relu(alpha = var_26, x = linear_0_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, [128, 128]> model_linear_1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [16384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1496640))), lut = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1513088))), name = tensor<string, []>("model_linear_1_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([128, 128])];
            tensor<fp16, [128]> model_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("model_linear_1_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1513664)))];
            tensor<fp16, [21, 589, 128]> linear_1_cast_fp16 = linear(bias = model_linear_1_bias_to_fp16, weight = model_linear_1_weight_to_fp16_palettized, x = input_33_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [21, 589, 128]> input_37_cast_fp16 = leaky_relu(alpha = var_26, x = linear_1_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [7, 128]> model_classifier_weight_to_fp16 = const()[name = tensor<string, []>("model_classifier_weight_to_fp16"), val = tensor<fp16, [7, 128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1513984)))];
            tensor<fp16, [7]> model_classifier_bias_to_fp16 = const()[name = tensor<string, []>("model_classifier_bias_to_fp16"), val = tensor<fp16, [7]>([-0x1.01p+0, 0x1.67cp-2, 0x1.3d8p-1, 0x1.c8cp-2, -0x1.444p-2, -0x1.59p-1, -0x1.8fcp-2])];
            tensor<fp16, [21, 589, 7]> linear_2_cast_fp16 = linear(bias = model_classifier_bias_to_fp16, weight = model_classifier_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<fp16, [21, 589, 7]> powerset_softmax_cast_fp16 = softmax(axis = var_9, x = linear_2_cast_fp16)[name = tensor<string, []>("powerset_softmax_cast_fp16")];
            tensor<fp32, []> powerset_epsilon_0 = const()[name = tensor<string, []>("powerset_epsilon_0"), val = tensor<fp32, []>(0x1p-149)];
            tensor<fp16, [21, 589, 7]> powerset_cast_fp16 = log(epsilon = powerset_epsilon_0, x = powerset_softmax_cast_fp16)[name = tensor<string, []>("powerset_cast_fp16")];
            tensor<fp16, [21, 589, 7]> powerset_probs_1_cast_fp16 = exp(x = powerset_cast_fp16)[name = tensor<string, []>("powerset_probs_1_cast_fp16")];
            tensor<fp16, [3, 7]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [3, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1515840)))];
            tensor<fp16, [3]> speaker_probs_bias_0_to_fp16 = const()[name = tensor<string, []>("speaker_probs_bias_0_to_fp16"), val = tensor<fp16, [3]>([0x0p+0, 0x0p+0, 0x0p+0])];
            tensor<fp16, [21, 589, 3]> speaker_probs = linear(bias = speaker_probs_bias_0_to_fp16, weight = transpose_0_to_fp16, x = powerset_probs_1_cast_fp16)[name = tensor<string, []>("speaker_probs_cast_fp16")];
            tensor<int32, []> var_157 = const()[name = tensor<string, []>("op_157"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<bool, []>(false)];
            tensor<string, []> var_159_output_dtype_0 = const()[name = tensor<string, []>("op_159_output_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, [21, 589]> var_159_cast_fp16 = reduce_argmax(axis = var_157, keep_dims = var_158, output_dtype = var_159_output_dtype_0, x = powerset_cast_fp16)[name = tensor<string, []>("op_159_cast_fp16")];
            tensor<int32, []> var_161_one_hot_vector_size_0 = const()[name = tensor<string, []>("op_161_one_hot_vector_size_0"), val = tensor<int32, []>(7)];
            tensor<int32, []> var_161_axis_0 = const()[name = tensor<string, []>("op_161_axis_0"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_161_on_value_0 = const()[name = tensor<string, []>("op_161_on_value_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_161_off_value_0 = const()[name = tensor<string, []>("op_161_off_value_0"), val = tensor<int32, []>(0)];
            tensor<int32, [21, 589, 7]> var_161 = one_hot(axis = var_161_axis_0, indices = var_159_cast_fp16, off_value = var_161_off_value_0, on_value = var_161_on_value_0, one_hot_vector_size = var_161_one_hot_vector_size_0)[name = tensor<string, []>("op_161")];
            tensor<string, []> cast_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("cast_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [3, 7]> transpose_1_to_fp16 = const()[name = tensor<string, []>("transpose_1_to_fp16"), val = tensor<fp16, [3, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1515968)))];
            tensor<fp16, [3]> speaker_ids_bias_0_to_fp16 = const()[name = tensor<string, []>("speaker_ids_bias_0_to_fp16"), val = tensor<fp16, [3]>([0x0p+0, 0x0p+0, 0x0p+0])];
            tensor<fp16, [21, 589, 7]> var_161_to_fp16 = cast(dtype = cast_1_to_fp16_dtype_0, x = var_161)[name = tensor<string, []>("cast_1")];
            tensor<fp16, [21, 589, 3]> speaker_ids = linear(bias = speaker_ids_bias_0_to_fp16, weight = transpose_1_to_fp16, x = var_161_to_fp16)[name = tensor<string, []>("speaker_ids_cast_fp16")];
            tensor<int32, [1]> reduce_max_0_axes_0 = const()[name = tensor<string, []>("reduce_max_0_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<bool, []> reduce_max_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_max_0_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [21, 589]> reduce_max_0_cast_fp16 = reduce_max(axes = reduce_max_0_axes_0, keep_dims = reduce_max_0_keep_dims_0, x = speaker_probs)[name = tensor<string, []>("reduce_max_0_cast_fp16")];
            tensor<int32, [2]> var_202_begin_0 = const()[name = tensor<string, []>("op_202_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_202_end_0 = const()[name = tensor<string, []>("op_202_end_0"), val = tensor<int32, [2]>([1, 589])];
            tensor<bool, [2]> var_202_end_mask_0 = const()[name = tensor<string, []>("op_202_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<bool, [2]> var_202_squeeze_mask_0 = const()[name = tensor<string, []>("op_202_squeeze_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [589]> var_202_cast_fp16 = slice_by_index(begin = var_202_begin_0, end = var_202_end_0, end_mask = var_202_end_mask_0, squeeze_mask = var_202_squeeze_mask_0, x = reduce_max_0_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<int32, [589]> slice_by_index_0 = const()[name = tensor<string, []>("slice_by_index_0"), val = tensor<int32, [589]>([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588])];
            tensor<string, []> scatter_0_mode_0 = const()[name = tensor<string, []>("scatter_0_mode_0"), val = tensor<string, []>("update")];
            tensor<int32, []> scatter_0_axis_0 = const()[name = tensor<string, []>("scatter_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> scatter_0_validate_indices_0 = const()[name = tensor<string, []>("scatter_0_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1767]> _aggregated_voice_activity_to_fp16 = const()[name = tensor<string, []>("_aggregated_voice_activity_to_fp16"), val = tensor<fp16, [1767]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1516096)))];
            tensor<fp16, [1767]> scatter_0_cast_fp16 = scatter(axis = scatter_0_axis_0, data = _aggregated_voice_activity_to_fp16, indices = slice_by_index_0, mode = scatter_0_mode_0, updates = var_202_cast_fp16, validate_indices = scatter_0_validate_indices_0)[name = tensor<string, []>("scatter_0_cast_fp16")];
            tensor<string, []> scatter_1_mode_0 = const()[name = tensor<string, []>("scatter_1_mode_0"), val = tensor<string, []>("update")];
            tensor<int32, []> scatter_1_axis_0 = const()[name = tensor<string, []>("scatter_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> scatter_1_validate_indices_0 = const()[name = tensor<string, []>("scatter_1_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [589]> var_217_to_fp16 = const()[name = tensor<string, []>("op_217_to_fp16"), val = tensor<fp16, [589]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1519744)))];
            tensor<fp16, [1767]> scatter_1_cast_fp16 = scatter(axis = scatter_1_axis_0, data = _aggregated_voice_activity_to_fp16, indices = slice_by_index_0, mode = scatter_1_mode_0, updates = var_217_to_fp16, validate_indices = scatter_1_validate_indices_0)[name = tensor<string, []>("scatter_1_cast_fp16")];
            tensor<int32, [1]> var_234_begin_0 = const()[name = tensor<string, []>("op_234_begin_0"), val = tensor<int32, [1]>([58])];
            tensor<int32, [1]> var_234_end_0 = const()[name = tensor<string, []>("op_234_end_0"), val = tensor<int32, [1]>([647])];
            tensor<bool, [1]> var_234_end_mask_0 = const()[name = tensor<string, []>("op_234_end_mask_0"), val = tensor<bool, [1]>([false])];
            tensor<fp16, [589]> var_234_cast_fp16 = slice_by_index(begin = var_234_begin_0, end = var_234_end_0, end_mask = var_234_end_mask_0, x = scatter_0_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<int32, [2]> var_237_begin_0 = const()[name = tensor<string, []>("op_237_begin_0"), val = tensor<int32, [2]>([1, 0])];
            tensor<int32, [2]> var_237_end_0 = const()[name = tensor<string, []>("op_237_end_0"), val = tensor<int32, [2]>([2, 589])];
            tensor<bool, [2]> var_237_end_mask_0 = const()[name = tensor<string, []>("op_237_end_mask_0"), val = tensor<bool, [2]>([false, true])];
            tensor<bool, [2]> var_237_squeeze_mask_0 = const()[name = tensor<string, []>("op_237_squeeze_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [589]> var_237_cast_fp16 = slice_by_index(begin = var_237_begin_0, end = var_237_end_0, end_mask = var_237_end_mask_0, squeeze_mask = var_237_squeeze_mask_0, x = reduce_max_0_cast_fp16)[name = tensor<string, []>("op_237_cast_fp16")];
            tensor<fp16, [589]> var_239_cast_fp16 = add(x = var_234_cast_fp16, y = var_237_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [589]> slice_by_index_2 = const()[name = tensor<string, []>("slice_by_index_2"), val = tensor<int32, [589]>([58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646])];
            tensor<string, []> scatter_2_mode_0 = const()[name = tensor<string, []>("scatter_2_mode_0"), val = tensor<string, []>("update")];
            tensor<int32, []> scatter_2_axis_0 = const()[name = tensor<string, []>("scatter_2_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> scatter_2_validate_indices_0 = const()[name = tensor<string, []>("scatter_2_validate_indices_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1767]> scatter_2_cast_fp16 = scatter(axis = scatter_2_axis_0, data = scatter_0_cast_fp16, indices = slice_by_index_2, mode = scatter_2_mode_0, updates = var_239_cast_fp16, validate_indices = scatter_2_validate_indices_0)[name = tensor<string, []>("scatter_2_cast_fp16")];
            tensor<int32, [1]> var_249_begin_0 = const()[name = tensor<string, []>("op_249_begin_0"), val = tensor<int32, [1]>([58])];
